backend/app/controllers/questions_controller.rb

    def index
        render json: Question.all, status: :ok
---
SELECT "questions".* FROM "questions"