backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        render json: User.all, status: :ok

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show_current
        user = User.find_by(id: session[:user_id])

INSERT INTO "users" ("username", "first_name", "last_name", "password_digest", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        user = User.create!(user_params)